In [3]:
import pandas as pd
import numpy as np

In [4]:
myData = np.array([[10,20,30], [20,30,40], [50,70,30], [60,30,50]])

In [5]:
myData

array([[10, 20, 30],
       [20, 30, 40],
       [50, 70, 30],
       [60, 30, 50]])

In [6]:
myNames = ["Ali", "Veli", "Ahmet", "Alaiddin"]

In [7]:
myColumns = ["Jan", "Feb", "March"]

In [8]:
myDataFrame = pd.DataFrame(myData)

In [9]:
myDataFrame

    0   1   2
0  10  20  30
1  20  30  40
2  50  70  30
3  60  30  50

In [10]:
type(myDataFrame)

pandas.core.frame.DataFrame

In [11]:
myDataFrame[1]

0    20
1    30
2    70
3    30
Name: 1, dtype: int32

In [12]:
newDataFrame = pd.DataFrame(myData, index=myNames, columns=myColumns)

In [13]:
newDataFrame

          Jan  Feb  March
Ali        10   20     30
Veli       20   30     40
Ahmet      50   70     30
Alaiddin   60   30     50

In [14]:
newDataFrame["Feb"]

Ali         20
Veli        30
Ahmet       70
Alaiddin    30
Name: Feb, dtype: int32

In [15]:
type(newDataFrame["Feb"])

pandas.core.series.Series

In [16]:
newDataFrame["March"].mean()

37.5

In [17]:
janSeries = newDataFrame["Jan"]

In [18]:
janSeries.sum()

140

In [19]:
janSeries.max()

60

In [20]:
janSeries.Alaiddin

60

In [21]:
newDataFrame[["Jan", "Feb"]]

          Jan  Feb
Ali        10   20
Veli       20   30
Ahmet      50   70
Alaiddin   60   30

In [22]:
newDataFrame.loc["Ali"]

Jan      10
Feb      20
March    30
Name: Ali, dtype: int32

In [23]:
type(newDataFrame.loc["Ali"])

pandas.core.series.Series

In [24]:
newDataFrame.iloc[3]

Jan      60
Feb      30
March    50
Name: Alaiddin, dtype: int32

In [25]:
newDataFrame["Apr"] = newDataFrame["March"] * 2

In [26]:
newDataFrame

          Jan  Feb  March  Apr
Ali        10   20     30   60
Veli       20   30     40   80
Ahmet      50   70     30   60
Alaiddin   60   30     50  100

In [27]:
newDataFrame.drop("Veli",axis=0) #Yeni bir DataFrame döner. axis=0(row) axis=1(column)

          Jan  Feb  March  Apr
Ali        10   20     30   60
Ahmet      50   70     30   60
Alaiddin   60   30     50  100

In [28]:
newDataFrame

          Jan  Feb  March  Apr
Ali        10   20     30   60
Veli       20   30     40   80
Ahmet      50   70     30   60
Alaiddin   60   30     50  100

In [29]:
newDataFrame.drop("Apr", axis=1)

          Jan  Feb  March
Ali        10   20     30
Veli       20   30     40
Ahmet      50   70     30
Alaiddin   60   30     50

In [30]:
newDataFrame.drop("Apr", axis=1, inplace=True) #Yeni bir DataFrame dönmez! newDataFrame değişkenimiz üzerinde değişiklik sağlar.

In [31]:
newDataFrame

          Jan  Feb  March
Ali        10   20     30
Veli       20   30     40
Ahmet      50   70     30
Alaiddin   60   30     50

In [32]:
newDataFrame["Jan"].Alaiddin

60

In [33]:
newDataFrame["Jan"]["Alaiddin"]

60

In [35]:
newDataFrame

          Jan  Feb  March
Ali        10   20     30
Veli       20   30     40
Ahmet      50   70     30
Alaiddin   60   30     50

In [36]:
booleanFrame = newDataFrame > 25

In [37]:
booleanFrame

            Jan    Feb  March
Ali       False  False   True
Veli      False   True   True
Ahmet      True   True   True
Alaiddin   True   True   True

In [38]:
newDataFrame[booleanFrame]

           Jan   Feb  March
Ali        NaN   NaN     30
Veli       NaN  30.0     40
Ahmet     50.0  70.0     30
Alaiddin  60.0  30.0     50

In [39]:
newDataFrame[newDataFrame > 30]

           Jan   Feb  March
Ali        NaN   NaN    NaN
Veli       NaN   NaN   40.0
Ahmet     50.0  70.0    NaN
Alaiddin  60.0   NaN   50.0

In [43]:
newDataFrame[newDataFrame["Jan"] > 30]

          Jan  Feb  March
Ahmet      50   70     30
Alaiddin   60   30     50

In [44]:
newDataFrame.reset_index()

      index  Jan  Feb  March
0       Ali   10   20     30
1      Veli   20   30     40
2     Ahmet   50   70     30
3  Alaiddin   60   30     50

In [45]:
newDataFrame

          Jan  Feb  March
Ali        10   20     30
Veli       20   30     40
Ahmet      50   70     30
Alaiddin   60   30     50

In [46]:
newDataFrame["NewIndex"] = ["A", "V", "Ah", "Al"]

In [47]:
newDataFrame

          Jan  Feb  March NewIndex
Ali        10   20     30        A
Veli       20   30     40        V
Ahmet      50   70     30       Ah
Alaiddin   60   30     50       Al

In [48]:
newDataFrame.set_index("NewIndex")

          Jan  Feb  March
NewIndex
A          10   20     30
V          20   30     40
Ah         50   70     30
Al         60   30     50

In [49]:
newDataFrame.drop("NewIndex", axis=1, inplace=True)

In [50]:
newDataFrame

          Jan  Feb  March
Ali        10   20     30
Veli       20   30     40
Ahmet      50   70     30
Alaiddin   60   30     50